import ProjectsList from "@/components/projects-list/ProjectsList";
import { getAllProjectsWithoutCustomers } from "@/db/db";
import Image from "next/image";
import Link from "next/link";

import tgLogo from "@/public/icons8-телеграм.svg";
import vkLogo from "@/public/icons8-vk.svg";

export default async function Home() {
  const projects = await getAllProjectsWithoutCustomers();

  return (
    <>
      <div className="custom-screen max-w-[1280px] w-[100%] px-4 m-auto items-center flex-col gap-16">
        <section className="relative" id="top">
          <div className="w-full flex flex-col items-center justify-center gap-6 relative overflow-hidden">
            <video autoPlay loop className="w-full" src="/compress.mp4" muted>
            </video>

            <div
              className="absolute w-full h-full bg-black bg-opacity-80"
              style={{
                background:
                  "linear-gradient(180deg, rgba(2,0,36,1) 0%, rgba(77,77,77,0.039653361344537785) 60%)",
              }}
            ></div>

            <div className="absolute top-[10%]">
              <h1 className="text-white md:text-5xl text-3xl font-semibold text-center uppercase">
                Лаборатория идей «Политех<span className="text-[#39AAE1]">Медиа</span>»
              </h1>
            </div>
            {/* <Link
              className="w-full max-w-[200px] py-3 text-white font-bold flex items-center justify-center bg-blue-400 rounded-xl mx-auto"
              href="#contacts"
            >
              Связаться с нами
            </Link> */}
          </div>

          <div className="flex flex-wrap xl:justify-between justify-center mt-6 gap-4 xl:absolute xl:bottom-[-10%] xl:ml-[8%]">
            <div className=" shadow-md w-full xl:max-w-[342px] h-[225px] py-4 px-6 bg-white">
              <h2 className="text-[#39AAE1] text-7xl font-bold">1</h2>
              <h3 className="font-semibold text-xl text-gray-900 mt-4">
                Работаем над проектами в условиях нечёткого или отсутствующего
                ТЗ
              </h3>
              {/* <p className="text-gray-900 text-sm">
              </p> */}
            </div>

            <div className=" shadow-md w-full xl:max-w-[342px] h-[225px] py-4 px-6 bg-white">
              <h2 className="text-[#39AAE1] text-7xl font-bold">2</h2>
              <h3 className="font-semibold text-xl text-gray-900 mt-4">
                Используем широкий спектр мультимедийных интерактивных
                технологий
              </h3>
              {/* <p className="text-gray-900 text-sm">
                Ищем профессионалов и приглашаем их для сотрудничества,
                формируем ТЗ
              </p> */}
            </div>

            <div className=" shadow-md w-full xl:max-w-[342px] h-[225px] py-4 px-6 bg-white">
              <h2 className="text-[#39AAE1] text-7xl font-bold">3</h2>
              <h3 className="font-semibold text-xl text-gray-900 mt-4">
                Разрабатываем форму, дизайн и информационное наполнение продукта
              </h3>
              {/* <p className="text-gray-900 text-sm">
                Договариваемся с администрацией или руководителями и устраиваем
                шоу!
              </p> */}
            </div>
          </div>
        </section>

        <section id="about" className="xl:mt-[220px]">
          <h2 className="mt-10 mb-4 text-gray-900 font-bold text-3xl text-center">
            О компании
          </h2>

          <p className="mb-6 max-w-[1058px] m-auto my-8 text-xl mb-[40px]">
            Творческое конструкторское бюро "Политех/Медиа" сформировалось на
            кафедре "Дизайн и технологии медиаиндустрии" Омского
            государственного технического университета в 2017 г. Оно возникло
            как сообщество единомышленников - преподавателей и студентов
            ИТ-шников, имеющих интерес к компьютерному творчеству и желание
            создавать нечто общественнозначимое, современное, уникальное,
            красочное.
          </p>

          <div className="flex flex-wrap gap-6 justify-between">
            <div className="w-full md:max-w-[600px] relative  shadow-md px-6 py-3 md:h-[160px] h-[225px] bg-white">
              <h3 className="font-semibold text-2xl text-gray-900 mt-4 mb-1">
                Интерактивные инсталляции
              </h3>
              <p className="text-gray-900 text-sm max-w-[65%]">
                Ищем профессионалов и приглашаем их для сотрудничества,
                формируем ТЗ
              </p>
              {/* <svg
                width="93"
                height="93"
                viewBox="0 0 93 93"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
                className="absolute bottom-0 right-0"
              >
                <path
                  d="M91.112 0.597656H14.8894C11.099 0.597656 7.46383 2.10339 4.78361 4.78361C2.10339 7.46383 0.597656 11.099 0.597656 14.8894V91.112C0.597656 94.9024 2.10339 98.5375 4.78361 101.218C7.46383 103.898 11.099 105.404 14.8894 105.404H91.112C94.9024 105.404 98.5375 103.898 101.218 101.218C103.898 98.5375 105.404 94.9024 105.404 91.112V14.8894C105.404 11.099 103.898 7.46383 101.218 4.78361C98.5375 2.10339 94.9024 0.597656 91.112 0.597656ZM33.945 95.8759H14.8894C13.6259 95.8759 12.4142 95.374 11.5208 94.4805C10.6274 93.5871 10.1255 92.3754 10.1255 91.112V85.4905C11.6531 86.0452 13.2642 86.3352 14.8894 86.348H33.945V95.8759ZM33.945 76.8202H14.8894C13.6259 76.8202 12.4142 76.3183 11.5208 75.4249C10.6274 74.5315 10.1255 73.3198 10.1255 72.0563V66.4349C11.6531 66.9895 13.2642 67.2795 14.8894 67.2924H33.945V76.8202ZM33.945 57.7646H14.8894C13.6259 57.7646 12.4142 57.2627 11.5208 56.3693C10.6274 55.4759 10.1255 54.2641 10.1255 53.0007V14.8894C10.1255 13.6259 10.6274 12.4142 11.5208 11.5208C12.4142 10.6274 13.6259 10.1255 14.8894 10.1255H33.945V57.7646ZM62.5285 95.8759H43.4728V67.2924H62.5285V95.8759ZM62.5285 57.7646H43.4728V10.1255H62.5285V57.7646ZM95.8759 91.112C95.8759 92.3754 95.374 93.5871 94.4805 94.4805C93.5871 95.374 92.3754 95.8759 91.112 95.8759H72.0563V86.348H91.112C92.7371 86.3352 94.3482 86.0452 95.8759 85.4905V91.112ZM95.8759 72.0563C95.8759 73.3198 95.374 74.5315 94.4805 75.4249C93.5871 76.3183 92.3754 76.8202 91.112 76.8202H72.0563V67.2924H91.112C92.7371 67.2795 94.3482 66.9895 95.8759 66.4349V72.0563ZM95.8759 53.0007C95.8759 54.2641 95.374 55.4759 94.4805 56.3693C93.5871 57.2627 92.3754 57.7646 91.112 57.7646H72.0563V10.1255H91.112C92.3754 10.1255 93.5871 10.6274 94.4805 11.5208C95.374 12.4142 95.8759 13.6259 95.8759 14.8894V53.0007ZM81.5841 29.1811C80.6419 29.1811 79.7209 29.4605 78.9374 29.984C78.154 30.5074 77.5434 31.2515 77.1829 32.122C76.8223 32.9925 76.7279 33.9503 76.9118 34.8744C77.0956 35.7985 77.5493 36.6474 78.2155 37.3136C78.8818 37.9799 79.7306 38.4336 80.6547 38.6174C81.5788 38.8012 82.5367 38.7069 83.4072 38.3463C84.2777 37.9857 85.0217 37.3751 85.5452 36.5917C86.0686 35.8083 86.348 34.8872 86.348 33.945C86.348 32.6816 85.8461 31.4698 84.9527 30.5764C84.0593 29.683 82.8476 29.1811 81.5841 29.1811ZM24.4172 38.7089C25.3594 38.7089 26.2805 38.4295 27.0639 37.9061C27.8473 37.3826 28.4579 36.6386 28.8185 35.7681C29.1791 34.8976 29.2734 33.9397 29.0896 33.0156C28.9058 32.0915 28.452 31.2427 27.7858 30.5764C27.1196 29.9102 26.2707 29.4565 25.3466 29.2727C24.4225 29.0888 23.4646 29.1832 22.5941 29.5437C21.7236 29.9043 20.9796 30.5149 20.4562 31.2983C19.9327 32.0818 19.6533 33.0028 19.6533 33.945C19.6533 35.2085 20.1552 36.4202 21.0486 37.3136C21.942 38.207 23.1537 38.7089 24.4172 38.7089Z"
                  fill="#F3A917"
                />
              </svg> */}
              <div className="absolute bottom-[35%] right-[24px] w-[50px] h-[50px] bg-[#39AAE1] rounded-[50%]"></div>
            </div>

            <div className="w-full md:max-w-[600px] relative  shadow-md px-6 py-3 md:h-[160px] h-[225px] bg-white">
              <h3 className="font-semibold text-2xl text-gray-900 mt-4 mb-1">
                Видеомэппинг
              </h3>
              <p className="text-gray-900 text-sm max-w-[65%]">
                Видеопроекция на здание/обьект сложной формы с учетом его
                геометрии и положения в пространстве
              </p>
              {/* <svg
                width="93"
                height="93"
                viewBox="0 0 93 93"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
                className="absolute bottom-0 right-0"
              >
                <path
                  d="M91.112 0.597656H14.8894C11.099 0.597656 7.46383 2.10339 4.78361 4.78361C2.10339 7.46383 0.597656 11.099 0.597656 14.8894V91.112C0.597656 94.9024 2.10339 98.5375 4.78361 101.218C7.46383 103.898 11.099 105.404 14.8894 105.404H91.112C94.9024 105.404 98.5375 103.898 101.218 101.218C103.898 98.5375 105.404 94.9024 105.404 91.112V14.8894C105.404 11.099 103.898 7.46383 101.218 4.78361C98.5375 2.10339 94.9024 0.597656 91.112 0.597656ZM33.945 95.8759H14.8894C13.6259 95.8759 12.4142 95.374 11.5208 94.4805C10.6274 93.5871 10.1255 92.3754 10.1255 91.112V85.4905C11.6531 86.0452 13.2642 86.3352 14.8894 86.348H33.945V95.8759ZM33.945 76.8202H14.8894C13.6259 76.8202 12.4142 76.3183 11.5208 75.4249C10.6274 74.5315 10.1255 73.3198 10.1255 72.0563V66.4349C11.6531 66.9895 13.2642 67.2795 14.8894 67.2924H33.945V76.8202ZM33.945 57.7646H14.8894C13.6259 57.7646 12.4142 57.2627 11.5208 56.3693C10.6274 55.4759 10.1255 54.2641 10.1255 53.0007V14.8894C10.1255 13.6259 10.6274 12.4142 11.5208 11.5208C12.4142 10.6274 13.6259 10.1255 14.8894 10.1255H33.945V57.7646ZM62.5285 95.8759H43.4728V67.2924H62.5285V95.8759ZM62.5285 57.7646H43.4728V10.1255H62.5285V57.7646ZM95.8759 91.112C95.8759 92.3754 95.374 93.5871 94.4805 94.4805C93.5871 95.374 92.3754 95.8759 91.112 95.8759H72.0563V86.348H91.112C92.7371 86.3352 94.3482 86.0452 95.8759 85.4905V91.112ZM95.8759 72.0563C95.8759 73.3198 95.374 74.5315 94.4805 75.4249C93.5871 76.3183 92.3754 76.8202 91.112 76.8202H72.0563V67.2924H91.112C92.7371 67.2795 94.3482 66.9895 95.8759 66.4349V72.0563ZM95.8759 53.0007C95.8759 54.2641 95.374 55.4759 94.4805 56.3693C93.5871 57.2627 92.3754 57.7646 91.112 57.7646H72.0563V10.1255H91.112C92.3754 10.1255 93.5871 10.6274 94.4805 11.5208C95.374 12.4142 95.8759 13.6259 95.8759 14.8894V53.0007ZM81.5841 29.1811C80.6419 29.1811 79.7209 29.4605 78.9374 29.984C78.154 30.5074 77.5434 31.2515 77.1829 32.122C76.8223 32.9925 76.7279 33.9503 76.9118 34.8744C77.0956 35.7985 77.5493 36.6474 78.2155 37.3136C78.8818 37.9799 79.7306 38.4336 80.6547 38.6174C81.5788 38.8012 82.5367 38.7069 83.4072 38.3463C84.2777 37.9857 85.0217 37.3751 85.5452 36.5917C86.0686 35.8083 86.348 34.8872 86.348 33.945C86.348 32.6816 85.8461 31.4698 84.9527 30.5764C84.0593 29.683 82.8476 29.1811 81.5841 29.1811ZM24.4172 38.7089C25.3594 38.7089 26.2805 38.4295 27.0639 37.9061C27.8473 37.3826 28.4579 36.6386 28.8185 35.7681C29.1791 34.8976 29.2734 33.9397 29.0896 33.0156C28.9058 32.0915 28.452 31.2427 27.7858 30.5764C27.1196 29.9102 26.2707 29.4565 25.3466 29.2727C24.4225 29.0888 23.4646 29.1832 22.5941 29.5437C21.7236 29.9043 20.9796 30.5149 20.4562 31.2983C19.9327 32.0818 19.6533 33.0028 19.6533 33.945C19.6533 35.2085 20.1552 36.4202 21.0486 37.3136C21.942 38.207 23.1537 38.7089 24.4172 38.7089Z"
                  fill="#FD567E"
                />
              </svg> */}
              <div className="absolute bottom-[35%] right-[24px] w-[50px] h-[50px] bg-[#39AAE1] rounded-[50%]"></div>
            </div>

            <div className="w-full md:max-w-[600px] relative  shadow-md px-6 py-3 md:h-[160px] h-[225px] bg-white">
              <h3 className="font-semibold text-2xl text-gray-900 mt-4 mb-1">
                3D-моделирование
              </h3>
              <p className="text-gray-900 text-sm max-w-[65%]">
                Ищем профессионалов и приглашаем их для сотрудничества,
                формируем ТЗ
              </p>
              <div className="absolute bottom-[35%] right-[24px] w-[50px] h-[50px] bg-[#39AAE1] rounded-[50%]"></div>
              {/* <Image className="absolute bottom-0 right-0 w-[100px]" src={icon} alt=""></Image> */}
            </div>

            <div className="w-full md:max-w-[600px] relative  shadow-md px-6 py-3 md:h-[160px] h-[225px] bg-white">
              <h3 className="font-semibold text-2xl text-gray-900 mt-4 mb-1">
                Дополненная реальность
              </h3>
              <p className="text-gray-900 text-sm max-w-[65%]">
                Ищем профессионалов и приглашаем их для сотрудничества,
                формируем ТЗ
              </p>
              {/* <svg
                width="93"
                height="93"
                viewBox="0 0 93 93"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
                className="absolute bottom-0 right-0"
              >
                <path
                  d="M91.112 0.597656H14.8894C11.099 0.597656 7.46383 2.10339 4.78361 4.78361C2.10339 7.46383 0.597656 11.099 0.597656 14.8894V91.112C0.597656 94.9024 2.10339 98.5375 4.78361 101.218C7.46383 103.898 11.099 105.404 14.8894 105.404H91.112C94.9024 105.404 98.5375 103.898 101.218 101.218C103.898 98.5375 105.404 94.9024 105.404 91.112V14.8894C105.404 11.099 103.898 7.46383 101.218 4.78361C98.5375 2.10339 94.9024 0.597656 91.112 0.597656ZM33.945 95.8759H14.8894C13.6259 95.8759 12.4142 95.374 11.5208 94.4805C10.6274 93.5871 10.1255 92.3754 10.1255 91.112V85.4905C11.6531 86.0452 13.2642 86.3352 14.8894 86.348H33.945V95.8759ZM33.945 76.8202H14.8894C13.6259 76.8202 12.4142 76.3183 11.5208 75.4249C10.6274 74.5315 10.1255 73.3198 10.1255 72.0563V66.4349C11.6531 66.9895 13.2642 67.2795 14.8894 67.2924H33.945V76.8202ZM33.945 57.7646H14.8894C13.6259 57.7646 12.4142 57.2627 11.5208 56.3693C10.6274 55.4759 10.1255 54.2641 10.1255 53.0007V14.8894C10.1255 13.6259 10.6274 12.4142 11.5208 11.5208C12.4142 10.6274 13.6259 10.1255 14.8894 10.1255H33.945V57.7646ZM62.5285 95.8759H43.4728V67.2924H62.5285V95.8759ZM62.5285 57.7646H43.4728V10.1255H62.5285V57.7646ZM95.8759 91.112C95.8759 92.3754 95.374 93.5871 94.4805 94.4805C93.5871 95.374 92.3754 95.8759 91.112 95.8759H72.0563V86.348H91.112C92.7371 86.3352 94.3482 86.0452 95.8759 85.4905V91.112ZM95.8759 72.0563C95.8759 73.3198 95.374 74.5315 94.4805 75.4249C93.5871 76.3183 92.3754 76.8202 91.112 76.8202H72.0563V67.2924H91.112C92.7371 67.2795 94.3482 66.9895 95.8759 66.4349V72.0563ZM95.8759 53.0007C95.8759 54.2641 95.374 55.4759 94.4805 56.3693C93.5871 57.2627 92.3754 57.7646 91.112 57.7646H72.0563V10.1255H91.112C92.3754 10.1255 93.5871 10.6274 94.4805 11.5208C95.374 12.4142 95.8759 13.6259 95.8759 14.8894V53.0007ZM81.5841 29.1811C80.6419 29.1811 79.7209 29.4605 78.9374 29.984C78.154 30.5074 77.5434 31.2515 77.1829 32.122C76.8223 32.9925 76.7279 33.9503 76.9118 34.8744C77.0956 35.7985 77.5493 36.6474 78.2155 37.3136C78.8818 37.9799 79.7306 38.4336 80.6547 38.6174C81.5788 38.8012 82.5367 38.7069 83.4072 38.3463C84.2777 37.9857 85.0217 37.3751 85.5452 36.5917C86.0686 35.8083 86.348 34.8872 86.348 33.945C86.348 32.6816 85.8461 31.4698 84.9527 30.5764C84.0593 29.683 82.8476 29.1811 81.5841 29.1811ZM24.4172 38.7089C25.3594 38.7089 26.2805 38.4295 27.0639 37.9061C27.8473 37.3826 28.4579 36.6386 28.8185 35.7681C29.1791 34.8976 29.2734 33.9397 29.0896 33.0156C28.9058 32.0915 28.452 31.2427 27.7858 30.5764C27.1196 29.9102 26.2707 29.4565 25.3466 29.2727C24.4225 29.0888 23.4646 29.1832 22.5941 29.5437C21.7236 29.9043 20.9796 30.5149 20.4562 31.2983C19.9327 32.0818 19.6533 33.0028 19.6533 33.945C19.6533 35.2085 20.1552 36.4202 21.0486 37.3136C21.942 38.207 23.1537 38.7089 24.4172 38.7089Z"
                  fill="#3E8BFF"
                />
              </svg> */}
              <div className="absolute bottom-[35%] right-[24px] w-[50px] h-[50px] bg-[#39AAE1] rounded-[50%]"></div>
            </div>
          </div>

          <div className="flex justify-between w-full text-[#39AAE1] py-6 px-4 mt-6 items-center bg-[#39AAE1]">
            <p className="text-white font-semibold text-xl">
              У вас есть интересный проект?
            </p>
            <Link
              href="#contacts"
              className="bg-white p-2 text-xs text-[#39AAE1] font-semibold shadow-sm flex items-center justify-center text-center max-h-14"
            >
              Связаться с нами
            </Link>
          </div>
        </section>

        <div id="projects" className="xl:mt-[180px]">
          <ProjectsList projects={projects} />
        </div>
        <section id="contacts">
          <h2 className="xl:mt-[180px] mb-10 text-gray-900 font-bold text-3xl text-center">
            Контакты
          </h2>
          <div className="flex md:justify-between md:flex-row flex-col gap-4">
            <iframe
              src="https://yandex.ru/map-widget/v1/?um=constructor%3A9cd4beba281a298ab562252e24fa0488dee5863cb54f450f100cbf46d83387dd&amp;source=constructor"
              width="928"
              height="647"
              className=" max-h-[320px] max-w-[850px] w-full shadow-md"
            ></iframe>
            <div className="bg-white  px-6 py-4">
              <h2 className="text-gray-900 font-bold text-3xl mb-2 mt-3">
                Всегда на связи
              </h2>
              <address>
                <div>
                  <a
                    className="text-gray-900 font-bold text-xl mb-2 mt-3"
                    href="tel:+79136021597"
                  >
                    8 (913) 602-15-97
                  </a>
                  <p className="text-gray-900 mb-2">
                    Звоните с 09:00 до 18:00 по МСК
                  </p>
                </div>
                <div>
                  <a
                    className="text-gray-900 font-bold text-xl mb-2 mt-3"
                    href="mailto:p-media@inbox.ru"
                  >
                    p-media@inbox.ru
                  </a>
                  <p className="text-gray-900 mb-2">Пишите, когда вам удобно</p>
                </div>
                <div className="flex gap-3">
                  <Link href="#">
                    <div className="flex gap-2 items-center">
                      <Image
                        src={tgLogo}
                        alt="Tg-logo"
                        width={50}
                        height={50}
                      ></Image>
                      <p>Telegram</p>
                    </div>
                  </Link>
                  <Link href="https://vk.com/politechmedia" target="_blank">
                    <div className="flex gap-2 items-center">
                      <Image
                        src={vkLogo}
                        alt="Tg-logo"
                        width={50}
                        height={50}
                      ></Image>
                      <p>ВКонтакте</p>
                    </div>
                  </Link>
                </div>
              </address>
            </div>
          </div>
          <div className="flex justify-between w-full text-white py-6 px-4 mt-6 items-center bg-[#39AAE1]"><p className="text-white font-semibold text-xl">г. Омск, пр. Мира 11<span className="hidden xl:inline">, корпус 6</span>, к. 6-338</p> </div>

        </section>
        <Link className="block xl:hidden" href='#top'><div className="fixed bottom-[10px] right-[10px] bg-[#39AAE1] w-[50px] h-[50px] text-white text-center text-4xl rounded-[50%]">
          ▲
        </div></Link>
      </div>
    </>
  );
}
